#include <stdio.h>
//void test()
//{
//	printf("hehe");
//}
//int main()
//{
//	test(100);
//	return 0;
//}
//int main()
//{
//	int a = 20;
//	int b = -10;
//	char c = 'a';
//
//	return 0;
//}
//int main()
//{
//	char a = -128;
//	//100000000000000000000000100000000  原码
//	//111111111111111111111111011111111  反码
//	//111111111111111111111111100000000  补码
//	//100000000char类型只有8个比特位  存储的补码
//	printf("%u\n", a);
//	//%d 打印有符号的十进制整数。
//	//%u 打印无符号的十进制整数。
//	//补码 1000000000  
//	//整形提升  000000000000000000000001000000000
//	//反码      000000000000000000000000111111111
//	//原码      111111111111111111111111000000000
//	//所以打印的数字很大。
//	return 0;
//int main()
//{
//	char a = -1;//char会有整形提升和整形截断。
//	//一开始以int类型进行补码运算，最后存储是进行整形截断，即只存储最后8位。最高位仍视为符号位
//	signed char b = -1;//有符号char类型，同上，一般都是有符号类型，通常省略signed。
//	unsigned char c = -1;//无符号char类型，最高位不视为符号位。
//	printf("a = %d,b = %d,c = %d", a, b, c);
//	//此处打印的都是%d类型有符号十进制整数。
//	//在运算时会进行整形提升，即用32位算。
//	//用c举例。
//	//补码 11111111
//	//整形提升，由于为无符号数，前面加零，
//	//000000000000000000000111111111 整形提升后的补码
//	//由于最前面为0，时正数，原反补相同，说以为255.
//	return 0;
//}
//int main()
//{
//	unsigned int i = 0;
//	for(i = 9; i >= 0; i--)//死循环，还是那个⚪。无符号是0 到 2 ^32-1.
//	{
//		printf("%u\n", i);
//	}
//	return 0;
//}
//int main()
//{
//	char arr[1000];
//	int i = 1;
//	for (i = 0; i < 1000; i++)
//	{
//		arr[i] = -1 - i;
//	}
//	printf("%d", strlen(arr));//strlen不算0，在0前面停
//	//一开始是从-1开始算起，到-128，+1到127，再一直减到1，0遇到0停下，且不计算。
//	return 0;
//}